Repository: jonandreas/straumur-payments
Catalog: languages/straumur-payments-for-woocommerce-*.po
Languages: is_is

source: https://straumur.is/veflausnir
is_is: https://straumur.is

source: Facilitates seamless payments using Straumur's Hosted Checkout in WooCommerce.
is_is: Auðveldar og öruggar greiðslur með Greiðslusíðu Straums í WooCommerce.

source: Invalid order.
is_is: Ógild pöntun.

source: Order not paid with Straumur.
is_is: Pöntun ekki greidd í gegnum Straum.

source: Cannot cancel: missing payment references.
is_is: Get ekki hætt við: vantar tilvísunarnúmer greiðslu.

source: Straumur payment cancellation request sent
is_is: Beiðni um að hætta við greiðslu send til Straums

source: Failed to send cancellation request to Straumur.
is_is: Tókst ekki að senda beiðni um að hætta við greiðslu til Straums.

source: Cannot capture: missing payment references.
is_is: Get ekki staðfest greiðslu: Vantar tilvísunarnúmer greiðslu.

source: Straumur payment capture request sent
is_is: Beiðni um staðfestingu á greiðslu send til Straums

source: Failed to send capture request to Straumur.
is_is: Tókst ekki að senda beiðni um staðfestingu á greiðslu til Straums.

source: Cannot refund: missing payment references.
is_is: Get ekki endurgreitt: vantar tilvísunarnúmer greiðslu.

source: Straumur refund request has been sent to Straumur.
is_is: Endurgreiðslubeiðni send til Straums.

source: Failed to send refund request to Straumur.
is_is: Tókst ekki að senda endurgreiðslubeiðni til Straums.

source: Accept payments via Straumur Hosted Checkout.
is_is: Takið á móti greiðslum með Greiðslusíðu Straums.

source: Payment error: Unable to initiate payment session.
is_is: Greiðsluvilla: Tókst ekki að setja upp greiðslulotu.

source: Nonce verification failed.
is_is: Nonce staðfesting tókst ekki.

source: Your payment session was not completed. Please try again.
is_is: Greiðslulotan var ekki kláruð. Vinsamlegast reyndu aftur.

source: Enable/Disable
is_is: Virkja/Afvirkja

source: Enable Straumur Payments
is_is: Virkja Straums greiðslur

source: Test Mode
is_is: Prófunarhamur

source: Enable Test Mode
is_is: Virkja prófunarham

source: If enabled, the gateway will use the sandbox URL.
is_is: Ef virkjað, þá mun viðbótin einungis nota prófunarslóð Straums.

source: Title
is_is: Titill

source: This controls the title which the user sees during checkout.
is_is: Þetta gildi stýrir hvaða titil notendur sjá í greiðsluferlinu.

source: Description
is_is: Lýsing

source: This controls the description which the user sees during checkout.
is_is: Þetta gildi stýrir hvaða lýsingu notendur sjá í greiðsluferlinu.

source: Pay via Straumur Hosted Checkout.
is_is: Greiðslur í gegnum Greiðslusíðu Straums.

source: Theme key
is_is: Þemalykill

source: Theme key, logo colors, etc.
is_is: Þemalykill, lógó litir o.fl.

source: Authorize Only (Manual Capture)
is_is: Einungis heimild (Handvirk staðfesting)

source: Enable authorize only mode. Payments will require manual capture.
is_is: Virkja heimildarham. Handvirkt þarf að staðfesta greiðslur.

source: If enabled, payments will be authorized but not captured automatically.
is_is: Ef það er virkt verða greiðslur heimilaðar en ekki teknar sjálfkrafa.

source: Mark Order as Completed
is_is: Merkja pöntun sem lokið

source: If enabled, orders will be marked as Completed after a successful payment instead of Processing.
is_is: Ef virkjað, verða pantanir merktar sem lokið eftir að greiðsla hefur gengið í gegn í stað þess að vera merktar sem í vinnslu.

source: Send cart items
is_is: Senda inn hluti í körfu

source: Send cart items to the checkout page. Disable if using incompatible plugins.
is_is: Senda inn hluti í körfu inn á greiðslusíðu Straums. Afvirkið ef verið er að nota ósamhæfar viðbótir.

source: Checkout Expiry (hours)
is_is: Tímamörk greiðsluferlis (klst)

source: 5 minutes
is_is: 5 mínútur

source: 10 minutes
is_is: 10 mínútur

source: 15 minutes
is_is: 15 mínútur

source: 30 minutes
is_is: 30 mínútur

source: 1 hour
is_is: 1 klukkustund

source: 2 hours
is_is: 2 klukkustundir

source: 4 hours
is_is: 4 klukkustundir

source: 6 hours
is_is: 6 klukkustundir

source: 12 hours
is_is: 12 klukkustundir

source: 24 hours
is_is: 24 klukkustundir

source: How long before checkout sessions expire (approx).
is_is: Hversu lengi greiðsluferli gildir áður en það rennur út (um það bil).

source: Abandon URL
is_is: Slóð fyrir yfirgefna greiðslu

source: Optional URL to redirect shoppers if they cancel or abandon the payment page.
is_is: Valfrjáls slóð sem notandinn er sendur á ef hann hættir við eða yfirgefur greiðslusíðuna.

source: Custom Success URL
is_is: Sérsniðin slóð á Greiðsla tókst síðu

source: Optional URL to redirect shoppers after a successful payment. If left empty, the default WooCommerce thank-you page is used.
is_is: Valfrjáls slóð sem notandinn er sendur á eftir að greiðsla hefur gengið í gegn. Ef skilið eftir tómt, þá er sjálfgefna þakkarsíða WooCommerce notuð.

source: Payment Page Terminal Identifier
is_is: Auðkenni útstöðvar fyrir greiðslusíðu

source: The Terminal Identifier provided by Straumur.
is_is: Auðkenni útstöðvar er fengið frá Straum.

source: Payment Gateway Terminal Identifier
is_is: Auðkenni útstöðvar fyrir greiðslugátt

source: API Key
is_is: API Lykill

source: The API Key provided by Straumur.
is_is: API lykilinn er fenginn frá Straum.

source: HMAC Key
is_is: HMAC lykill

source: Your HMAC secret key used to validate incoming webhooks.
is_is: HMAC lykilinn þinn er notaður til að sannreyna móttekna vefkróka.

source: Use this URL in your Straumur dashboard to configure webhooks. Click the field to select all.
is_is: Notið þessa slóð á þjónustuvef Straums þar sem við á. Smellið á slóðina til að velja hana.

source: Production URL is required when Test Mode is disabled.
is_is: Slóð á raunumhverfi er nauðsynleg þegar prófunarhamur er afvirkjaður.

source: Pay securely using Straumur hosted checkout.
is_is: Öruggar greiðslur í gegnum Greiðslusíðu Straums.

source: Transaction failed
is_is: Greiðsla mistókst

source: Payment declined: The card was refused (declined).
is_is: Greiðslu hafnað: Kortið var hafnað.

source: Payment failed: The card has expired.
is_is: Greiðsla mistókst: Kortið er útrunnið.

source: Payment failed: 3D Secure verification failed.
is_is: Greiðsla mistókst: 3D Secure auðkenning tókst ekki.

source: Straumur %1$s failed: %2$s. Reference: %3$s
is_is: Straumur Webhook: payfacReference: %s

source: No merchantReference or invalid.
is_is: Vantar eða ógildur kaupanda tilvísunarkóði (merchantReference).

source: No order found for merchantReference: %d
is_is: Engin pöntun fannst með kaupanda tilvísunarkóða: %d

source: verified by 3D Secure
is_is: staðfest af 3D Secure

source: not verified by 3D Secure
is_is: ekki staðfest af 3D Secure

source: Straumur refund/cancellation %s (unknown type)
is_is: Beiðni um að hætta við greiðslu send til Straums

source: Card ending in %1$s has been saved for automatic subscription payments, %2$s (Auth code: %3$s).
is_is: Kort með endinguna %1$s hefur verið vistað fyrir áskriftargreiðslu, %2$s (Auth code: %3$s).

source: N/A
is_is: Ekki tiltækt

source: Manual capture completed for %1$s via Straumur (reference: %2$s).
is_is: Handvirk staðfesting greðslu fyrir %1$s gegnum Straumur (reference: %2$s).

source: Cancellation confirmed by Straumur. Reference: %s.
is_is: Greiðsla staðfest af Straum með webhook.

source: A refund amount of %1$s has been processed by Straumur. Reference: %2$s.
is_is: Endurgreiðsla að upphæð %1$s hefur verið afgreidd af Straum. Reference: %2$s.

source: No HMAC secret configured in settings.
is_is: Enginn HMAC leynilykill skilgreindur í stillingum.

source: Invalid HMAC key configured in settings.
is_is: Ógildur HMAC lykill skilgreindur í stillingum.

source: Straumur Payments for WooCommerce requires WooCommerce to be installed and active.
is_is: Til að nota Straumur payments for WooCommerce viðbótina þarf WooCommerce að vera uppsett á virkt.

source: Settings
is_is: Stillingar

source: Documentation
is_is: Skjölun

source: Support
is_is: Aðstoð

source: Subscription cancelled due to refunded payment.
is_is: Áskrift óvirkjuð eftir endurgreiðslu

source: Delivery
is_is: Afhending

source: Subscription renewal authorized via token payment.
is_is: Áskrift endurnýjuð með skuldfærslu á greiðslukort

source: Subscription renewal requires redirect: %s
is_is: Skuldfærsla gekk ekki

source: Token payment failed.
is_is: Skuldfærsla gekk ekki

source: Thank you for your order! Your payment is being processed.
is_is: Takk fyrir pöntunina, greiðslustaðfesting er í vinnslu

source: Required field missing: %s.
is_is: Nauðsynlegar upplýsingar vantar: %s.

source: Failed payment processed successfully.
is_is: Greiðsla tókst ekki

source: Error processing webhook.
is_is: Ekki gekk að vinna webhook

source: Order %d not found for failed webhook.
is_is: Pöntun fannst ekki við greiðslustaðfestingu

source: Order not found.
is_is: Pöntun fannst ekki

source: Unknown Straumur event type received: %s.
is_is: Villa frá Straumi

source: Token value is missing in tokenization event.
is_is: Sýndarkort vantar

source: Error saving payment token.
is_is: Ekki gekk að vist greiðslukort

source: Invalid HMAC key format. Must be a hexadecimal string.
is_is: HMAC kenni ekki á réttu formi

source: HMAC signature validation failed.
is_is: HMAC auðkenning gekk ekki
